namespace SportsGuideBKP.Model
{
    public class OlympicSymbolsRepo
    {
        List<OlympicSymbols> AllOlympicSymbols = new List<OlympicSymbols>()
        {
            new OlympicSymbols
            {
                ID = 1,
                Name = "Фриги",
                Description = "14 ноября 2022 года организационный комитет Олимпиады 2024 презентовал официальный талисман Игр — фригийский колпак по имени Фриги. Это головной убор красного цвета, который является символом Французской Республики. Он олицетворяет свободу. Его носили еще в Древней Греции и Риме, во время строительства собора Нотр-Дам и Эйфелевой башни, во время революции 1789 года и во время Олимпийских игр 1924 года в Париже. Маскот Олимпиады-2024 напоминает о многовековой истории Франции и ее борьбе за равноправие.",
                OlympicDate = "Летние Олимпийские игры 2024 во Франции, Париж",
                Image = "frigi.png"
            },
            new OlympicSymbols
            {
                ID = 2,
                Name = "Бин Дунь Дунь и Сюэ Жунжун",
                Description = "Бин Дунь Дунь представляет собой большую панду в костюме изо льда, похожем на скафандр астронавта. На современном китайском слово «бин» имеет несколько значений, но в первую очередь означает лед, а вместе с ним — чистоту и силу. «Дунь Дунь» значит здоровый, крепкий и жизнерадостный. Так организаторы выражают связь с новыми технологиями и будущим, где возможности безграничны. Яркие разноцветные кольца вокруг мордочки талисмана представляют новейшие ледовые и снежные арены Пекина, построенные по передовым технологиям. Сердечко на левой лапе символизирует гостеприимность Китая по отношению ко всем участникам и зрителям Белой Олимпиады.\r\nВторым талисманом Зимней Олимпиады 2022 стал ребенок в костюме, напоминающем традиционные китайские фонарики. Его зовут Сюэ Жунжун, это имя происходит от китайских слов «снег» и «тепло». По замыслу организаторов, этот персонаж символизирует внимательное отношение к людям с ограниченными возможностями, а также чрезвычайную важность культурного обмена.",
                OlympicDate = "Зимние Олимпийские игры 2022 в Пекине, Китай",
                Image = "binbin.png"
            },
            new OlympicSymbols
            {
                ID = 3,
                Name = "Мирайтова",
                Description = "Имя талисмана Летних Игр 2020 года, прошедших в 2021 году, происходит от японских слов «мирай» (будущее) и «това» (вечность). Паралимпийский символ назвали именем Сомэйти — так называют популярный сорт сакуры, что созвучно с английским выражением «so mighty» (такой могучий). В образе талисманов сочетаются традиционные и футуристические черты, которые воплощаются в японской идее «от традиции к инновациям». На лбу у маскотов изображена эмблема Олимпиады-2020 в Токио, а сами талисманы раскрашены четырехугольниками цвета индиго и розовый на манер шахматной доски.",
                OlympicDate = "Летние Олимпийские игры 2020 в Токио, Япония",
                Image = "miraitova.png"
            },
            new OlympicSymbols
            {
                ID = 4,
                Name = "Сухоран и Бандаби",
                Description = "Поскольку обычный тигр уже был симполом корейской Олимпиады в Сеуле в 1988 году, то в Пхёнчхане талисманом стал Сухоран, белый тигр. Это животное традиционно в корейской культуре считается символом защиты. Сухоран отличается страстью и соревновательным духом, является верным другом и защитником всех спортсменов, болельщиков и других участников Зимних Олимпийских игр 2018 года. Черный медведь Бандаби как символ мощи и доброты стал официальным талисманом Зимних Паралимпийских игр 2018 года. Так эти два контрастных персонажа смогли воплотить единство противоположностей, которое так высоко ценится в Азии.",
                OlympicDate = "Зимние Олимпийские игры 2018 в Пхёнчхане, Южная Корея",
                Image = "soohorang_and_bandabi.png"
            },
            new OlympicSymbols
            {
                ID = 5,
                Name = "Винисиус и Том",
                Description = "Талисманом Олимпийских игр в Рио было желтое кошкообразное существо по имени Винисиус, а символом Паралимпийских игр был Том, сине-зеленая фигура, голова которой была покрыта листьями. Они представляли собой яркий и жизнерадостный народ Бразилии, а также богатую фауну и дикую природу этой большой южноамериканской страны. Имена маскотам были выбраны в честь музыкантов Винисиуса де Морайса и Тома Жобима. Интересно, что символы Олимпиады в Рио были утверждены больше, чем за 2 года до самих Игр. На публике талисманы впервые появились в виде ростовых кукол в Экспериментальной олимпийской гимназии имени Хуана Антонио Самаранча, бывшего президента МОК. Это школа в Рио-де-Жанейро, открытая перед Олимпиадой для развития юных спортсменов.",
                OlympicDate = "Летние Олимпийские игры 2016 года в Рио-де-Жанейро, Бразилия",
                Image = "vinustom.png"
            },
            new OlympicSymbols
            {
                ID = 6,
                Name = "Белый Мишка, Леопард и Зайка",
                Description = "У Олимпиады в Сочи было три талисмана: заяц, белый медведь и леопард. Они представляли три места на олимпийском пьедестале. Маскотов очень долго отбирали сначала внутри России, а потом конкурс вышел на международный уровень. Всего было более 24 тыс. предложений, но в итоге выбрали 10, из которых пришлось выбрать трех. У каждого сочинского персонажа есть свой конечный автор: Сильвия Петрова создала Зайку, Олег Сердечный придумал Белого Мишку (явно родственника бурого медведя Михаила Топтыгина из 1980 года), а Вадим Пак нарисовал Леопарда. Продажи маскотов стартовали задолго до Олимпиады, и организаторы смогли извлечь большую выгоду от продажи сувениров Сочи-2014.",
                OlympicDate = "Зимние Олимпийские игры 2014 в Сочи, Россия",
                Image = "triplet.png"
            },
            new OlympicSymbols
            {
                ID = 7,
                Name = "Венлок и Мандевиль",
                Description = "Венлок и Мандевиль представляют собой абстрактных персонажей, которые были официальными талисманами летних Олимпийских и Паралимпийских игр 2012 года в Лондоне. Идея в том, что эти персонажи должны были напоминать сам олимпийский стадион. У каждого из них есть по одному большому глазу, а желтые огоньки на головах символизируют лондонские такси. На своих запястьях Венлок носит пять браслетов в цветах олимпийских колец. А три навершия на голове обозначают три места на пьедестале почета для медалистов. Венлок так назван в честь города Мач Венлок в графстве Шропшир, где до сих пор проводятся Венлокские игры. Они в свое время послужили одним из источников вдохновения для барона Пьера де Кубертена, создателя современных Олимпийских игр.",
                OlympicDate = "Летние Олимпийские игры 2012 года в Лондоне, Великобритания",
                Image = "wenlock_and_mandeville.png"
            },
            new OlympicSymbols
            {
                ID = 8,
                Name = "Мига и Куатчи",
                Description = "Мига — это вымышленный морской медведь, Куатчи — снежный человек-сасквоч, мечтающий стать хоккеистом. Еще одним талисманом (неофициальным) был редкий ванкуверский сурок Мукмук, который тоже снискал большую популярность. Имя его происходит от слова «макэмак», которое значит «еда» на чинукском. Хотя изначально Мукмук существовал только на бумаге и в цифровом формате, позже стали выпускать игрушки, сувениры и другие товары с его изображением.",
                OlympicDate = "Зимние Олимпийские игры 2010 в Ванкувере, Канада",
                Image = "vancouver.jpg"
            },
            new OlympicSymbols
            {
                ID = 9,
                Name = "Фува",
                Description = "Миролюбивые китайцы решили каждый из пяти континентов снабдить своим талисманом: рыба, панда, антилопа, ласточка и дитя огня. Они создали пять героев по числу природных стихий, дали им особые имена. Каждое имя состоит из двух повторяющихся слогов: Бэй-Бэй, Цзин-Цзин, Хуань-Хуань, Ин-Ин, Ни-Ни. Так китайцы делают, когда хотят ласково назвать ребенка. Если сложить пять имен вместе, получится фраза «Добро пожаловать в Пекин» (Bei Jing Huan Ying Nin). Эти талисманы известны как Фува, что в переводе с китайского означает «удача». В Китае более 100 телеканалов показывали 100 серий мультфильма «Олимпийские приключения Фува». Их также транслировали в общественном транспорте Пекина и в поездах по всему Китаю. Количество зрителей не поддается исчислению.",
                OlympicDate = "Летние Олимпийские игры 2008 года в Пекине, Китай",
                Image = "fuva.png"
            },
            new OlympicSymbols
            {
                ID = 10,
                Name = "Неве и Глиц",
                Description = "На итальянском языке «неве» значит снег, а «глиц» происходит от слова «гьяччо», что значит лед. Неве – это снежок, а Глиц – льдинка. Вместе они представляют собой то, без чего невозможно провести Зимние Олимпийские Игры, и они олицетворяют зимние виды спорта в целом. Неве носит красное, и своими мягкими линиями передает гармонию и изящество движения атлеток-женщин. Угловатый синий Глиц представляет силу и мощь спортсменов-мужчин.",
                OlympicDate = "Зимние Олимпийские игры 2006 года в Турине, Италия",
                Image = "neveglin.png"
            },
            new OlympicSymbols
            {
                ID = 11,
                Name = "Афина и Феб",
                Description = "Было бы странно, если бы для Игр на родине Олимпиады были выбраны абстрактные фигурки или банальные звери. Это брат и сестра, которые находятся в равноправном положении. Имена талисманам Олимпийских Игр в Афинах даны в честь древних богов. Феб – это одно из имен Аполлона, бога света и музыки. Афина — это богиня мудрости и покровительница Афин. Эти талисманы символизируют связь между античной Грецией и современными Олимпийскими играми. Необычная форма персонажей напоминает терракотовых кукол в форме колокола, относящихся к VII веку до н.э. Маскоты также символизируют радость от состязаний и провозглашают олимпийские ценности.",
                OlympicDate = "Летние Олимпийские игры 2004 года в Афинах, Греция",
                Image = "afinafeb.png"
            },
            new OlympicSymbols
            {
                ID = 12,
                Name = "Пудра, Медь и Уголь",
                Description = "Зайчиха, койот и медведь были призваны стать олицетворением девиза «Быстрее, выше, сильнее». Их имена Пудра (Powder), Медь (Copper) и Уголь (Coal) были вдохновлены природными ресурсами Юты — заснеженными склонами и полезными ископаемыми. История талисманов восходит к фольклору коренных индейцев Северной Америки. На шее каждый персонаж носит ожерелье с наскальным изображением своего животного в духе древних местных культур Анасази и Фримонт. Эти три животных часто действуют как главные герои в сказках и мифах коренных народов, но стиль изображения маскотов весьма похож на современную детскую анимацию.",
                OlympicDate = "Зимние Олимпийские игры 2002 года в Солт-Лейк-Сити, США",
                Image = "medugol.png"
            },
            new OlympicSymbols
            {
                ID = 13,
                Name = "Сид, Олли и Милли",
                Description = "Эта веселая троица зверей должна была стать символом всего, что только возможно. Утконос Сид представлял Сидней, кукабарра Олли была символом Олимпиады, а ехидна Милли был представителем Миллениума. Еще эти мультяшные зверята были покровителями воды, воздуха и земли. Это был 2000 год, и австралийцы хотели в символизме обойти всех, даже продвинутых в мифологии японцев. Эти маскоты, ко всему прочему, являются еще и символами Австралии. Одним из главных условий во время конкурса персонажей был отказ от эксплуатации образов кенгуру и коалы, что было бы слишком просто.",
                OlympicDate = "Летние Олимпийские игры 2000 года в Сиднее, Австралия",
                Image = "isos.png"
            },
            new OlympicSymbols
            {
                ID = 14,
                Name = "Совята",
                Description = "Это сразу четыре совенка с именами Сукки, Нокки, Лекки и Цукки. Они известны как Сноулетс (Snowlets). Символизируют собой четыре сезо, четыре года между Играми и четыре стихии: огонь, воздух, землю и воду. «Snow», то есть англ. «снег» является прямой отсылкой к зиме, когда проходят Игры. «Let’s», то есть «Давайте!», представляет собой форму приглашения на красочные спортивные состязания. Если взять первые две буквы имен совят на английском, то можно написать «Snowlets». Кроме того, слово «owlets» переводится с англ. как «совята». Мудрено и вычурно, совершенно в японском стиле. Совята выступают за мир, гармонию и добрую волю.",
                OlympicDate = "Зимние Олимпийские игры 1998 года в Нагано, Япония",
                Image = "sovata.png"
            },
            new OlympicSymbols
            {
                ID = 15,
                Name = "Иззи",
                Description = "Этот абстрактрый персонаж имеет полное имя Whatizit (англ. сленг. Что это?). Никто точно не знал, кто такой Иззи, и сперва к нему отнеслись весьма прохладно. Но потом художники добавили к эскизу живых деталей и придумали легенду о том, что Иззи является продуктом информационных технологий. Его необычное происхождение отражал синий цвет, а кроссовки подчеркивали близость к спорту. Интересно, что пять олимпийских колец располагаются в самых разных местах тела Иззи.",
                OlympicDate = "Летние Олимпийские игры 1996 года в Атланте, Джорджия",
                Image = "izzi.png"
            },
            new OlympicSymbols
            {
                ID = 16,
                Name = "Хакон и Кристин",
                Description = "Это был первый раз, когда талисманы были настоящими людьми, да еще и имели исторических прототипов. Имена талисманов отсылают к персонажам истории Норвегии XIII века, судьба которых тесно связана с Лиллехаммером. Это Хакон IV Хаконсон, который был королем Норвегии в 1217 – 1263 гг., и принцесса Кристин Сверресдоттер, его тетка. Этих талисманов на церемонии Открытия игр и на других мероприятия играли восемь пар детей, отобранных со всех регионов страны.",
                OlympicDate = "Зимние Олимпийские игры 1994 года в Лиллехаммере, Норвегия",
                Image = "hacon.png"
            },
            new OlympicSymbols
            {
                ID = 17,
                Name = "Коби",
                Description = "Коби — это каталонская овчарка, запечатленная в стиле кубизм. Ее так назвали в честь аббревиатуры COOB'92, оргкомитета Игр-1992 в Барселоне. Имя Коби было выбрано потому, что оно простое и легко произносится на большинстве языков. Автором Коби стал Хавьер Марискаль, которому впоследствии доверили создание еще нескольких персонажей, и они на церемонии Открытия Игр представляли изобразительное искусство и культуру Испании. Также был снят мультсериал «Труппа Коби», в котором рассказывалось о приключениях Коби и его друзей. Вышло 26 серий для детей от 5 до 12 лет. Права на показ этого мультфильма приобрели 24 телеканала.",
                OlympicDate = "Летние Олимпийские игры 1992 года в Барселоне, Испания",
                Image = "kobi.png"
            },
            new OlympicSymbols
            {
                ID = 18,
                Name = "Мажик",
                Description = "Автор талисмана Филип Мэресс создал необычного гнома Мажика, который также является и двумя геометрическими фигурами одновременно. Название появилось, когда Мэресс перечитывал описание талисмана, и обратил внимание на повторяющееся несколько раз слово «magique», то есть «волшебный». Этот маскот символизирует воображение и мечты, к которым стремятся спортсмены-олимпийцы. Звезда-куб Мажик стал первым талисманом после игр в Инсбруке 1976 года, который не был животным. Цвета талисмана означают национальный флаг Франции.",
                OlympicDate = "Зимние Олимпийские игры 1992 года в Альбервиле, Франция",
                Image = "madin.png"
            },
            new OlympicSymbols
            {
                ID = 19,
                Name = "Ходори",
                Description = "Имя талисмана «Ходори» является производным от названия тигра по-корейски («хо») и слова, которым корейцы нежно называют мальчиков («дори»). В азиатском фольклоре тигр является одним из центральных персонажей, который приносит удачу. Его главные качества – веселый нрав, храбрость и благородство. На голове у Ходори традиционная корейская шляпа сангмо, а на шее пять олимпийских колец. Звание талисмана тигренок выиграл у кролика, уток-мандаринок и белки. Также существует и девчачья версия талисмана, которую зовут Хосуни.",
                OlympicDate = "Летние Олимпийские игры 1988 года в Сеуле, Южная Корея",
                Image = "hodori.png"
            },
            new OlympicSymbols
            {
                ID = 20,
                Name = "Хайди и Хоуди",
                Description = "Впервые на зимних Олимпийских играх 1988 года было два талисмана, которыми стали белые медведи-близнецы Хайди и Хоуди, одетые в ковбойские костюмы. Их имена были выбраны после конкурса, проведенного зоопарком Калгари. Жюри, в котором были жители Калгари, пришлось отсматривать более 7000 вариантов. Имена медведей являются отсылкой к популярным приветствиям англоязычным приветствиям «Hi!» ( Привет!) и «How do you do» (Как дела?). Белые медведи активны зимой и не впадают в спячку, поэтому выбор этого животного в качестве маскота был очень удачным",
                OlympicDate = "Зимние Олимпийские игры 1988 года в Калгари, Канада",
                Image = "haidihoidi.png"
            },
            new OlympicSymbols
            {
                ID = 21,
                Name = "Сэм",
                Description = "Сначала американцы хотеля использовать в качестве талисмана медведя, который является одним из официальных символов Калифорнии. Но этот симпол уже был задействован в СССР на Олимпиаде-80. Но тут в дело включиласть студия Walt Disney, и из-под пера художников-аниматоров родился орленок Сэм. Он носит шляпу в цветах флага США, как популярный ранее персонаж агитационных комиксов и патриотической пропаганды Дядюшка Сэм. Но Олимпийский Сэм — это юный белоголовый орлан, который считается национальным символом США. Был снят даже мультфильм про орленка Сэма, который выпутывался из сложных ситуаций, используя магию пяти олимпийских колец.",
                OlympicDate = "Летние Олимпийские игры 1984 года в Лос-Анджелесе, США",
                Image = "sem.png"
            },
            new OlympicSymbols
            {
                ID = 22,
                Name = "Вучко",
                Description = "Имя «Вучко» переводится с сербохорватского как «волчонок».Талисманом зимних Олимпийских игр 1984 года действительно был волк — животное, которое часто встречается в лесах региона Динарских Альп. Но он выглядел не страшно, а забавно, и символизировал желание людей подружиться с животными. В югославском фольклоре часто присутствует образ волка, который воплощает смелость и силу, а также символизирует зиму. В правой руке маскота скрещенные пальцы намекают на удачу, которую талисман желает все участникам соревнований. Популярности Вучко способствовали также комиксы, которые публиковали ежедневные газеты и журналы-еженедельники.",
                OlympicDate = "Зимние Олимпийские игры 1984 года в Сараево, СФРЮ",
                Image = "vudcho.png"
            },
            new OlympicSymbols
            {
                ID = 23,
                Name = "Миша",
                Description = "Советские создатели образа для Олимпиады-80 решили сыграть на том образе, которые столетиями ассоциируется во всем мире с Россией. И выбрали в качестве талисмана медведя. Но это был не агрессивный медведь, а наш ласковый и добрый Миша-спортсмен, которого официально зовут Михаил Потапыч Топтыгин. На рассмотрение было отобрано более 60 вариантов эскизов, и победил знакомый всем образ, автором которого является детских художник-иллюстратор Виктор Чижиков. Медведь испокон веков был популярным персонажем русских сказок и рассказов, а после московских Игр и особенно церемонии закрытия на многие годы стал образцом успешного и всенародно любимого талисмана.",
                OlympicDate = "Летние Олимпийские игры 1980 года в Москве, СССР",
                Image = "misha.png"
            },
            new OlympicSymbols
            {
                ID = 24,
                Name = "Рони",
                Description = "Енот является одним из привычных животных для жителей североамериканского континента. Имя Рони было выбрано потому, что оно переводится как «енот» с ирокезского языка коренных жителей города Лейк-Плэсид, штат Нью-Йорк. Для рекламы Игр организаторы использовали даже двух живых енотов, взятых напрокат в зоопарке города Ютика. Они участвовали в телешоу, которое показывали в США. В образе енота Рони использованы цвета всех пяти олимпийских колец.",
                OlympicDate = "Зимние Олимпийские игры 1980 года в Лейк-Плэсиде, США",
                Image = "enot.png"
            },
            new OlympicSymbols
            {
                ID = 25,
                Name = "Амик",
                Description = "В Канаде был проведен национальный конкурс, чтобы найти имя для этого олимпийского талисмана. Амик на алгонквинском языке североамериканских индейцев в Канаде означает «бобр». Бобр был выбран потому, что он является национальным символом Канады, его изображение есть на гербах Монреаля и Кингстона. Канадцы любят изображать этого неутомимого труженика на марках и монетах. Красная лента с символом пяти колец, стилизованных под кленовый лист, отлично дополняет исконно канадский талисман.",
                OlympicDate = "Летние Олимпийские игры 1976 года в Монреале, Канада",
                Image = "homuia.png"
            },
            new OlympicSymbols
            {
                ID = 26,
                Name = "Шнееманн",
                Description = "Снеговик Шнееманн с глазками-уголькам стал первым в истории официальным талисманом зимних Олимпийских игр. На нем была красная тирольская шляпа, которую обычно носят в Австрии местные жители, а вместо носа торчала оранжевая морковка. Автором рисунка стал Вальтер Петш. Организаторы впервые создали легенду о зимних видах спорта, когда Шнееманн играет в хоккей, а потом катается на лыжах. Множество разных образов Шнееманна оказались чрезвычайно востребованы. Организаторы ОИ поняли, что образы талисманов должны быть детально проработаны, и тогда на этом можно будет хорошо заработать.",
                OlympicDate = "Зимние Олимпийские игры 1976 года в Инсбруке, Австрия",
                Image = "snegovik.png"
            }
        };
        public List<OlympicSymbols> GetAllOlympicSymbols()
        {
            return AllOlympicSymbols;
        }
    }
}
