namespace SportsGuideBKP.Model
{
    public class SummerOlympicRepo
    {
        List<OlympicGames> AllSummerOlympicGames = new List<OlympicGames>()
        {
            new OlympicGames
            {
                ID = 17,
                Name = "BMX-мотокросс",
                Description = "В BMX-гонках максимум восемь гонщиков соревнуются на трассе с прямыми участками, буграми и виражами. Побеждает тот, кто первым пересечет финишную черту.",
                Type = "",
                Image = "bmx.svg",
                DopDescription = new List<string>
                {
                    "Велосипедный мотокросс, или веломотокросс (BMX), появился в Калифорнии в конце 60-х. В то же время, когда в США стал популярен мотокросс. Именно мотосоревнования привели к появлению похожих соревнований, только на мускульной тяге.",
                    "BMX завораживал публику и не требовал больших инвестиций, а потому мгновенно снискал популярность – особенно в Калифорнии. В начале 70-х это привело к основанию в США управляющего органа. За следующее десятилетие BMX распространился на международном уровне."
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 18,
                Name = "BMX-фристайл",
                Description = "В BMX-фристайле спортсмены выполняют трюки на ровной поверхности, в городской среде, на грунтовой трассе, в хафпайпе и/или на специальной рампе. Судьи оценивают выступления по сложности, оригинальности и точности исполнения.",
                Type = "",
                Image = "bmf.svg",
                DopDescription = new List<string>
                {
                    "Как отдельная спортивная дисциплина BMX-фристайл выделился из веломотокросса, который зародился в конце 60-х в Калифорнии.",
                    "С 1980 по 1987 год популярность BMX-фристайла сильно выросла. Первым управляющим органом выступила основанная в 1982 году Ассоциация любительского скейт-парка. Спустя несколько лет она стала Американской ассоциацией фристайла. В конечном итоге BMX-фристайл взял под крыло Международный союз велосипедистов (UCI)."
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 19,
                Name = "Академическая гребля",
                Description = "Академическая гребля – это гонки на лодках с зафиксированными в уключинах веслами. В этой дисциплине гребцы сидят спиной к движению и финишную черту тоже пересекают спиной.",
                Type = "",
                Image = "row.svg",
                DopDescription = new List<string>
                {
                    "Гребные суда служили человеку транспортом еще в древних Египте, Греции и Риме. Спортивную направленность, судя по всему, гребля приобрела в Англии в XVII и начале XVIII века.",
                    "В 1828 году впервые состоялась знаменитая гонка между командами Оксфордского и Кембриджского университетов."
                },
                TopTier = "Elisabeta Oleniuc-Lipă (ROU)"
            },
            new OlympicGames
            {
                ID = 20,
                Name = "Бадминтон - это игра с ракетками и воланом, в которую играют на корте. В ней участвуют два игрока или две пары.",
                Description = "Названием этот вид спорта обязан усадьбе Бадминтон-хаус – резиденции английских герцогов Бофортов в Глостершире.",
                Type = "",
                Image = "bdm.svg",
                DopDescription = new List<string>
                {
                    "В 1873 году герцог представил гостям свою вариацию индийской игры «пуна».",
                    "Бадминтон быстро обрел популярность. Уже в 1877 году Батский бадминтонный клуб составил первый свод правил, а 16 лет спустя была основана Английская федерация бадминтона. В 1899 году она провела первый открытый чемпионат Англии."
                },
                TopTier = "Gao Ling (CHN)"
            },
            new OlympicGames
            {
                ID = 21,
                Name = "Баскетбол",
                Description = "Баскетбол – это командный вид спорта на прямоугольной площадке. Две команды по пять игроков соревнуются, кто наберет больше очков, забрасывая мяч в кольцо, или корзину, соперника.",
                Type = "",
                Image = "bkb.svg",
                DopDescription = new List<string>
                {
                    "Баскетбол придумал канадец Джеймс Нейсмит в декабре 1891 года. Он преподавал физкультуру в Международном тренировочном колледже YMCA в Массачусетсе и хотел поддерживать студентов в форме в холодное время года.",
                    "В 1893 году в массачусетском колледже Смит в Нортгемптоне прошел первый женский матч по баскетболу."
                },
                TopTier = "США"
            },
            new OlympicGames
            {
                ID = 22,
                Name = "Баскетбол 3x3",
                Description = "Баскетбол 3x3 – захватывающая современная городская версия баскетбола. Команды по три человека играют на одно кольцо на половине стандартной площадки. Баскетбол 3х3 чрезвычайно популярен и считается городским командным видом спорта номер один.",
                Type = "",
                Image = "bk3.svg",
                DopDescription = new List<string>
                {
                    "Баскетбол 3x3 – вариация традиционного баскетбола на полноразмерных площадках.",
                    "Баскетбол 3х3 произошел от популярного в городах США в конце 1980-х стритбола. Это упрощенная версия баскетбола, в которую играли во дворах и парках и которая стала культурным феноменом."
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 23,
                Name = "Бейсбол / Софтбол",
                Description = "Бейсбол и софтбол – схожие командные игры с мячом на ромбовидном поле.",
                Type = "",
                Image = "bsb.svg",
                DopDescription = new List<string>
                {
                    "Чемпионаты мира по бейсболу и софтболу проводятся как среди мужчин, так и среди женщин. На Олимпиадах мужчины выступают в бейсболе, а женщины играют в софтбол. Бейсбол и софтбол похожи, однако есть ряд различий. Помимо числа игроков в командах, отличаются размеры поля и некоторые правила.",
                    "Если в бейсбол играют твердым мячом, то в софтболе мяч мягкий. Кроме того, в софтболе короче расстояние между базами – 18 метров, а не 27."
                },
                TopTier = "США"
            },
            new OlympicGames
            {
                ID = 24,
                Name = "Бокс",
                Description = "Бокс – контактный вид спорта. Спортсмены наносят удары кулаками в голову или корпус соперника (выше пояса) и зарабатывают очки, которые присуждаются судьями, либо пытаются сделать так, чтобы соперник не смог продолжать бой.",
                Type = "",
                Image = "box.svg",
                DopDescription = new List<string>
                {
                    "Первые упоминания кулачного боя были найдены в Египте и датируются третьим тысячелетием до нашей эры. Набирать популярность в Европе бои на голых кулаках начали в XVI веке, преимущественно в Великобритании.",
                    "В 1867 году были опубликованы правила маркиза Куинсберри. Они стали первыми правилами бокса и обязали боксеров использовать боксерские перчатки."
                },
                TopTier = "László Papp (HUN), Teofilo Stevenson (CUB), Felix Savon (CUB)"
            },
            new OlympicGames
            {
                ID = 25,
                Name = "Борьба",
                Description = "Борьба – это вид спорта, в котором два спортсмена борются врукопашную и стремятся взять соперника в захват, свалить с ног и прижать лопатками к полу либо набрать больше баллов за время схватки.",
                Type = "",
                Image = "wre.svg",
                DopDescription = new List<string>
                {
                    "На Олимпийских играх проходят соревнования по двум видам борьбы: вольной и греко-римской. Правила похожи. Только в греко-римской нельзя атаковать соперника ниже пояса и выполнять захваты ногами.",
                    "Борьба считается одним из старейших соревновательных видов спорта в истории. Сравниться с ней в этом плане может только легкая атлетика."
                },
                TopTier = "Icho Kaori (JPN)"
            },
            new OlympicGames
            {
                ID = 26,
                Name = "Брейкинг",
                Description = "Брейк-данс, или брейкинг, проделал удивительный путь от улиц Нью-Йорка до главных спортивных арен мира. Как танцевальный стиль он зародился в 70-х годах прошлого века в Бронксе. Как спортивная дисциплина он объединяет в себе городской танец с невероятным атлетизмом. Брейкинг уходит корнями в культуру хип-хопа и примечателен яркими акробатическими движениями.",
                Type = "",
                Image = "bkg.svg",
                DopDescription = new List<string>
                {
                    "Брейкинг был изначально популярен среди афроамериканской и пуэрториканской молодежи. Молодые люди объединялись в команды и устраивали на улицах баттлы. Танцоров-парней называют би-бойз (b-boys), девушек – би-герлз (b-girls). «B» означает «break», то есть паузу. Свои трюки и движения танцоры, как правило, выполняют именно в инструментальных паузах.",
                    "Из уличных танцев брейк-данс превратился в мировое культурное явление, сочетающее музыку, танец и атлетизм. Брейкинг входит в число дисциплин Всемирной федерации танцевального спорта (WDSF), основанной в 1957 году. Первыми серьезными соревнованиями по брейкингу стали Игры WDSF в Китайском Тайбэе в 2013 году."
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 27,
                Name = "Водное поло",
                Description = "Водное поло, или ватерполо, – это спортивная игра в воде. В нее играют команды по семь человек, включая вратарей. Игроки одной команды носят шапочки одного цвета.",
                Type = "",
                Image = "wpo.svg",
                DopDescription = new List<string>
                {
                    "Игроки стараются забросить как можно больше мячей в ворота соперника. Команда, забившая больше к концу матча, побеждает.",
                    "В водное поло обычно играют в бассейнах глубиной три метра, чтобы игроки не могли отталкиваться от дна. Мужчины используют поле 30,6 на 20 метров, женщины – 25,6 на 20 метров."
                },
                TopTier = "Венгрия"
            },
            new OlympicGames
            {
                ID = 28,
                Name = "Волейбол",
                Description = "Это игра с мячом, в которую играют две команды по шесть человек на площадке, перегороженной сеткой. Изначально игра называлась «минтонет», так как по сути напоминала бадминтон.",
                Type = "",
                Image = "vvo.svg",
                DopDescription = new List<string>
                {
                    "Волейбол придумал Уильям Джордж Морган, преподаватель физического воспитания в колледже Ассоциации молодых христиан (YMCA), в 1895 году в Холиоке, штат Массачусетс.",
                    "Минтонет, как тогда называли игру, задумывался как веселое времяпрепровождение для старших членов YMCA. Некоторые элементы новая игра позаимствовала у других видов спорта, например, у тенниса и гандбола."
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 29,
                Name = "Гандбол",
                Description = "Гандбол – это динамичная командная игра в помещениях. Команды стараются забросить рукой как можно больше голов в ворота соперника.",
                Type = "",
                Image = "hbl.svg",
                DopDescription = new List<string>
                {
                    "Гандбол зародился в конце XIX века в Скандинавии и Германии. На рубеже XIX и XX веков получил признание филд-гандбол, в который играли на открытом воздухе 11 на 11. Версию игры для зала в 1910 году в Швеции представил Г. Валльстрем.",
                    "С 1938 по 1966 год отдельные чемпионаты мира проводились по обоим видам, но зальная версия постепенно вытеснила полевую."
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 30,
                Name = "Гольф",
                Description = "Цель гольфа состоит в том, чтобы, начав со стартовой позиции, забить клюшкой мяч в лунку за как можно меньшее количество ударов.",
                Type = "",
                Image = "glf.svg",
                DopDescription = new List<string>
                {
                    "Согласно некоторым исследованиям, в подобную игру под названием colf или kolven играли в Нидерландах, откуда она в XV веке попала на Британские острова.",
                    "Первую редакцию правил утвердили в 1754 году в шотландском Сент-Эндрюсе.\r\n\r\n"
                },
                TopTier = "Chandler Egan (USA)"
            },
            new OlympicGames
            {
                ID = 31,
                Name = "Гребля на байдарках и каноэ",
                Description = "В гребле на байдарках и каноэ гребцы на скорость преодолевают дистанцию от 200 до 1000 метров по гладкой воде.",
                Type = "",
                Image = "csp.svg",
                DopDescription = new List<string>
                {
                    "В гребле на байдарках и каноэ используются два вида лодок. Каноэ – открытые лодки, в которых гребец стоит на колене и гребет с одной стороны однолопастным веслом. У байдарок закрытый верх, гребец сидит и гребет двухлопастным веслом по обеим сторонам.",
                    "Наиболее популярные дисциплины – это индивидуальные гонки гребцов на одиночках, на Олимпийских играх также разыгрывают медали в гонках каноэ-двоек, байдарок-двоек и байдарок-четверок."
                },
                TopTier = "Birgit Fischer-Schmidt (GER)"
            },
            new OlympicGames
            {
                ID = 32,
                Name = "Гребной слалом",
                Description = "В гребном слаломе участники должны как можно быстрее преодолеть дистанцию до 300 метров по белой воде, то есть по бурному и порожистому участку реки или канала. На трассе устанавливается до 25 ворот, которые надо проходить по течению и против.",
                Type = "",
                Image = "csl.svg",
                DopDescription = new List<string>
                {
                    "Существует два типа лодок. В каноэ гребец пристегнут, стоит на одном колене и гребет однолопастным веслом. В байдарке гребец сидит и пользуется двухлопастным веслом.",
                    "В гребном слаломе участники должны как можно быстрее преодолеть дистанцию до 300 метров по белой воде, то есть по бурному и порожистому участку реки или канала. На трассе устанавливается до 25 ворот, которые надо проходить по течению и против.\r\n\r\nСуществует два типа лодок. В каноэ гребец пристегнут, стоит на одном колене и гребет однолопастным веслом. В байдарке гребец сидит и пользуется двухлопастным веслом.\r\n\r\nВ программу парижской Олимпиады-2024 впервые включен экстрим-слалом. В этой дисциплине старт не раздельный с индивидуальной фиксацией времени, а четыре гребца соревнуются друг с другом на укороченной дистанции."
                },
                TopTier = "Pavol and Peter Hochschorner (SVK)"
            },
            new OlympicGames
            {
                ID = 33,
                Name = "Дзюдо",
                Description = "Дзюдо - это японское боевое искусство, где делается упор на технику бросков, захватов и удушающих приемов. В дзюдо большое внимание уделяется физической подготовке, психологии и спортивному поведению.",
                Type = "",
                Image = "jud.svg",
                DopDescription = new List<string>
                {
                    "Отцом дзюдо считается японец Дзигоро Кано. В 1882 году он придумал действенную и безопасную форму физического воспитания и самообороны, которая опирается на принципы предельной эффективности.",
                    "Очки в дзюдо начисляются за броски, захваты и удушающие приемы. Задача спортсмена – с силой опрокинуть соперника на татами или удержать его определенное время в захвате.\r\n\r\n"
                },
                TopTier = "Nomura Tadahiro (JPN)"
            },

            new OlympicGames
            {
                ID = 34,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 35,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 36,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 37,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 38,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 39,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 40,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 41,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 42,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 43,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 44,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 45,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 46,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 47,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 48,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 49,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 50,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 51,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },

            new OlympicGames
            {
                ID = 52,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 53,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 54,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 55,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 56,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 57,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 58,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 59,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 60,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 61,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },

            new OlympicGames
            {
                ID = 62,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 63,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 64,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 65,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 66,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
            new OlympicGames
            {
                ID = 67,
                Name = "",
                Description = "",
                Type = "",
                Image = "",
                DopDescription = new List<string>
                {
                    "",
                    ""
                },
                TopTier = ""
            },
        };

        public List<OlympicGames> GetAllSummerGames()
        {
            return AllSummerOlympicGames;
        }
    }
}